In [14]:
import pandas as pd

In [18]:
x = [9, 3, 12]
sr = pd.Series(x)
print(sr)

0     9
1     3
2    12
dtype: int64

In [24]:
# Create a DataFrame
data = {'col1': [1, 2], 'col2': [3, 4]}
df = pd.DataFrame(data)
df.tail()

   col1  col2
0     1     3
1     2     4

In [26]:
# Write DataFrame to an Excel file
df.to_excel('output.xlsx', sheet_name='Sheet1', index=False)

In [28]:
df = pd.read_csv('car data.csv')
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 301 entries, 0 to 300
Data columns (total 9 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Car_Name       301 non-null    object
 1   Year           301 non-null    int64
 2   Selling_Price  301 non-null    float64
 3   Present_Price  301 non-null    float64
 4   Kms_Driven     301 non-null    int64
 5   Fuel_Type      301 non-null    object
 6   Seller_Type    301 non-null    object
 7   Transmission   301 non-null    object
 8   Owner          301 non-null    int64
dtypes: float64(2), int64(3), object(4)
memory usage: 21.3+ KB

In [30]:
df.head()

,Car_Name,Year,Selling_Price,Present_Price,Kms_Driven,Fuel_Type,Seller_Type,Transmission,Owner
0,ritz,2014,3.35,5.59,27000,Petrol,Dealer,Manual,0
1,sx4,2013,4.75,9.54,43000,Diesel,Dealer,Manual,0
2,ciaz,2017,7.25,9.85,6900,Petrol,Dealer,Manual,0
3,wagon r,2011,2.85,4.15,5200,Petrol,Dealer,Manual,0
4,swift,2014,4.60,6.87,42450,Diesel,Dealer,Manual,0

In [34]:
player_data = [['Player 1', 32, 75, 5428000],
['Player 2', 33, 74, 3428000],
['Player 3', 34, 70, 8428000],
['Player 4', 35, 80, 4428000],
['Player 5', 36, 100, 4528000],
['Player 6', 38, 72, 7028000],
['Player 7', 22, 85, 2528000]]
df = pd.DataFrame(player_data, columns=['Name', 'Age', 'Weight',
'Salary'])
print(df)

       Name  Age  Weight   Salary
0  Player 1   32      75  5428000
1  Player 2   33      74  3428000
2  Player 3   34      70  8428000
3  Player 4   35      80  4428000
4  Player 5   36     100  4528000
5  Player 6   38      72  7028000
6  Player 7   22      85  2528000

In [36]:
df1 = df.iloc[:,0:3]
print(df1)

       Name  Age  Weight
0  Player 1   32      75
1  Player 2   33      74
2  Player 3   34      70
3  Player 4   35      80
4  Player 5   36     100
5  Player 6   38      72
6  Player 7   22      85

In [38]:
data = df[df['Age'] > 34].iloc[:, :]
print("\nFiltered Data based on Age > 34:\n", data)

Filtered Data based on Age > 34:
        Name  Age  Weight   Salary
3  Player 4   35      80  4428000
4  Player 5   36     100  4528000
5  Player 6   38      72  7028000

In [44]:
data1 = {
"name": ['Uma', 'Nova', 'Bella'],
"age": [40, 50, 20]
}
data2 = {
"Education": ["Ph.D", "M.S", "B.S"]
}
df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)
newdf = df1.join(df2)

newdf.head()

    name  age Education
0    Uma   40      Ph.D
1   Nova   50       M.S
2  Bella   20       B.S

In [48]:
data1 = {
'EmployeeID' : ['E001', 'E002', 'E003', 'E004', 'E005'],
'Name' : ['Kelly', 'Cat', 'Mat', 'Jhon', 'Sam'],
'DeptID': ['D900', 'D800', 'D900', 'D700', 'D800'],
}
employees = pd.DataFrame(data1)
data2 = {
'DeptID': ['D900', 'D700', 'D800'],
'DeptName': ['Computer', 'Accounts', 'HR']
}
departments = pd.DataFrame(data2)
# merge dataframes employees and departments
merged_df = pd.merge(employees, departments)
merged_df.head()

  EmployeeID   Name DeptID  DeptName
0       E001  Kelly   D900  Computer
1       E002    Cat   D800        HR
2       E003    Mat   D900  Computer
3       E004   Jhon   D700  Accounts
4       E005    Sam   D800        HR